Revit 2026 API

# VertexBuffer Properties

---

The VertexBuffer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

VertexBuffer Class

Autodesk.Revit.DB.DirectContext3D Namespace